InformationRegisters/ЮклайнсМетрики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЮклайнсМетрики</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Успех</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяВыполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодОтвета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерДанных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерПопытки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипМетрики</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыМетрик</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодМс</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>39</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбъектовИнтеграции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/ЛогированиеСервер/Ext/Module.bsl
// Записывает данные в регистр сведений ЖурналЛогирования.
//
// Параметры:
//   Параметры - Структура - значения для заполнения реквизитов записи регистра
Процедура ЗаписатьВРегистрЛогированияФон(Параметры) Экспорт
	МенеджерЗаписи = РегистрыСведений.ЖурналЛогирования.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Параметры);
	Попытка
		МенеджерЗаписи.Записать(Истина);
	Исключение
		ЗаписьЖурналаРегистрации("Логирование.ЗаписьФон",УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

// Записывает метрику в регистр сведений для логирования операций.
//
// Параметры:
//   ТипМетрики - Строка - тип метрики
//   Операция - Строка - выполняемая операция
//   СтруктураДанных - Структура - значения для заполнения дополнительных полей записи
Процедура ЗаписатьМетрику(ТипМетрики, Операция, СтруктураДанных) Экспорт
	
	Менеджер = РегистрыСведений.ЮклайнсМетрики.СоздатьМенеджерЗаписи();
	Менеджер.ПериодМс = ТекущаяДатаСеанса();
	Менеджер.ТипМетрики = ТипМетрики; 
	Менеджер.ИдентификаторЗапроса = Строка(Новый УникальныйИдентификатор());
	Менеджер.Операция = Операция;

	ЗаполнитьЗначенияСвойств(Менеджер, СтруктураДанных);
	
	Попытка
		Менеджер.Записать();
	Исключение
		ЗаписьЖурналаРегистрации("Логирование.ЗаписатьМетрику",УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры
